Repository: flowsydev/flowsy-net-db-cli
Catalog: Flowsy.Db.Cli/Resources/Strings.*.resx
Languages: es

source: Host or IP Address
es: Host o dirección IP

source: Port
es: Puerto

source: Configuration source
es: Origen de configuraciones

# ConfigurationSourceEnvironment
source: Environment
es: Entorno

# ConfigurationNumberX
source: Configuration #{0}
es: Configuración #{0}

source: Configure another connection
es: Configurar otra conexión

source: Provider invariant name
es: Nombre invariante de proveedor

source: User
es: Usuario

source: Password
es: Contraseña

source: Additional options
es: Opciones adicionales

source: Database name
es: Nombre de la base de datos

# EnterConnectionKey
source: Enter a key to identify this connection
es: Introduzca una clave para identificar esta conexión

# BooleanAnswerYesLong
source: Yes
es: Si

# BooleanAnswerYesShort
source: Y
es: S

source: Configure migrations
es: Configurar migraciones

# DirectoryContainigMigrationScripts
source: Directory containing migration scripts
es: Carpeta que contiene scripts de migraciones

# SchemaContainingMigrationMetadata
source: Schema containing the table for migration metadata
es: Esquema que contiene la tabla para metadatos de migraciones

# TableContainingMigrationMetadata
source: Table to store migration metadata
es: Tabla para almacenar metadatos de migraciones

source: SQL statement to be executed after migrations
es: Instrucción SQL a ejecutarse después de las migraciones

# ChooseDatabaseOperation
source: Choose a database operation
es: Seleccione una operación de base de datos

source: Run migrations
es: Ejecutar migraciones

source: No configuration was provided.
es: No se proporcionó ninguna configuración.
